# Mini Project 2: Sales Data Analysis using Pandas

This notebook demonstrates loading, cleaning, transforming, and aggregating a sales dataset using Python and Pandas.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("sales_data.csv")
df

   Order_ID        Date Customer     Category Region   Sales  Quantity
0      1001  2023-01-05    Alice  Electronics  North  1200.0       2.0
1      1002  2023-01-07      Bob     Clothing  South   450.0       3.0
2      1003  2023-01-10  Charlie  Electronics   East     NaN       1.0
3      1004  2023-01-12    David    Furniture   West   800.0       1.0
4      1005  2023-01-15    Alice     Clothing  North   300.0       2.0
5      1006  2023-01-18      Eva  Electronics  South  1500.0       3.0
6      1007  2023-01-20    Frank    Furniture   East   700.0       NaN
7      1008  2023-01-22    Grace     Clothing   West   500.0       4.0

In [3]:
df.isnull().sum()

Order_ID    0
Date        0
Customer    0
Category    0
Region      0
Sales       1
Quantity    1
dtype: int64

In [4]:
df["Sales"] = df["Sales"].fillna(df["Sales"].mean())
df["Quantity"] = df["Quantity"].fillna(0)
df["Date"] = pd.to_datetime(df["Date"])

In [5]:
df = df.rename(columns={"Order_ID": "OrderID"})

In [6]:
sales_by_category = df.groupby("Category")["Sales"].sum().reset_index()
sales_by_category

      Category        Sales
0     Clothing  1250.000000
1  Electronics  3478.571429
2    Furniture  1500.000000

In [7]:
sales_by_region = df.groupby("Region")["Sales"].sum().reset_index()
sales_by_region

  Region        Sales
0   East  1478.571429
1  North  1500.000000
2  South  1950.000000
3   West  1300.000000

In [8]:
sales_by_category.sort_values(by="Sales", ascending=False)

      Category        Sales
1  Electronics  3478.571429
2    Furniture  1500.000000
0     Clothing  1250.000000

In [9]:
df.to_csv("cleaned_sales_data.csv", index=False)
sales_by_category.to_csv("sales_by_category.csv", index=False)
sales_by_region.to_csv("sales_by_region.csv", index=False)